# Profile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Sketch..::..Profile Property
Sketch Class See Also
---
Returns the Profile of the Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArrArray Profile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Profile As CurveArrArray
	Get
```

Visual C++
---
```text
public:
property CurveArrArray^ Profile {
	CurveArrArray^ get ();
}
```

# Remarks
This property is used to retrieve the Profile of Sketch.
# See Also
Sketch Class
Autodesk.Revit.DB Namespace